recursion.org
#+TITLE: Recursive Functions and Dynamic Programming
#+STARTUP: latexpreview

This document explains various uses of recursion and dynamic programming
* Definitions
- Recursive Function :: A function which calls itself
- Linear Recursion :: A function which recurs only once per call
- Memoization :: A recursive function which caches some of it's values to save time
- Dynamic Programming :: A form of programming which involves simplifying tasks into smaller subtasks

* Examples
** Factorial
This is a warm up and introduction to *recursion*. It calculates the factorial of a number using *linear recursion*.

The mathematical representation of this function is:
\begin{equation}
    f(x) =
    \begin{cases}
        1 &\mbox{if } x \leq 0 \\
        x * f(x-1) &\mbox{if } x > 0
    \end{cases}
\end{equation}

Here is the code:
#+NAME: factorial
#+BEGIN_SRC C++
long double
factorial(int n)
{
    return
        (n <= 0)
         ? 1
         : n * factorial(n - 1)
    ;
}
#+END_SRC

** Recursive Fibonacci
Now, on to the main event. Here, we will be making a function to calculate the nth Fibonacci Number.

The mathematical representation of the Fibonacci Sequence is:
\begin{equation}
fib_n =
    \begin{cases}
        1 &\mbox{if } x \leq 2 \\
        fib_{n-1} + fib_{n-2} &\mbox{if } x > 2
    \end{cases}
\end{equation}

Here is the code:
#+NAME: fibonacci_rec
#+BEGIN_SRC C++
long double
fibonacci_rec(int n)
{
    return
        (n<=2)
        ? 1
        : fibonacci_rec(n-1) + fibonacci_rec(n-2)
    ;
}
#+END_SRC

** Memoized Fibonacci
While the previous function worked, it has a major problem: performance. For every increase in size of the requested number, we have to calculate every previous number in the sequence! To solve this, we can create a static cache which stores any value generated by the fibonacci function. This allows it to only calculate information it doesn't already have, a process known as *memoization*.

Since this does not translate well into math, I'll write this in psudocode.
#+BEGIN_SRC text
  $cache := an array full of 0s

  fib :: integer $x
  function fib :=
     if $cache[$x] = 0
       $cache[$x] := fib($x - 1) + fib($x - 2)

     return $cache[$x]
  end
#+END_SRC

Here is the code:
#+NAME: fibonacci_mem
#+BEGIN_SRC C++
  long double
  fibonacci_mem(int n)
  {
      static std::vector<double> cache(100,0);

      if(cache[n] == 0)
          cache[n] =
              (n<=2)
              ? 1
              : fibonacci_mem(n-1) + fibonacci_mem(n-2)
          ;

      return cache[n];
  }
#+END_SRC

** Dynamic Fibonacci
While the *memoized* example was good, we can still do better. We can write this function non-recursively in order to prevent the overhead of calling a function by dividing it into 2 parts. This practice is *dynamic programming*.

The psudocode for this function is
#+BEGIN_SRC text
  fib :: Integer $x
  function fib :=
    $prev := 1; $prev2 := 1;

    for ($i <- 3..$x) do
      $buf   := $prev2
      $prev2 := $prev
      $prev  := $buf + $prev2
    end

    return $prev
  end
#+END_SRC

And the code is:
#+NAME: fibonacci_dyn
#+BEGIN_SRC C++
long double
fibonacci_dyn(int n)
{
    double prev = 1, prev2 = 1;

    for(int i = 3; i <= n; i++)
    {
        double buf = prev2;
        prev2 = prev;
        prev = buf + prev2;
    }

    return prev;
}
#+END_SRC

As you can see, we make the code calculate each number once and snake over the theoretical chain. This allows for linear execution time.

** Main
Here, I'm including some code which will makes use of each of the above functions. This is also the code I used in the benchmarks.

#+NAME: main
#+BEGIN_SRC C++
// I'm using macros here to define which function to benchmark without any overhead.
#define fn(n) factorial(n)
//#define fn(n) fibonacci_rec(n)
//#define fn(n) fibonacci_mem(n)
//#define fn(n) fibonacci_dyn(n)

int
main ()
{
    for(int i = 1; i <= 1000; i++)
        std::cout << "Function(" << i << ") = " << fn(i) << std::endl;
}
#+END_SRC

** Program Structure
This section shows how all of the above code comes together
#+BEGIN_SRC C++ :noweb yes :tangle out.cpp
  //This file is the result of tangling recursion.org. For a breakdown of how this works, refer to it.
  #include <iostream>
  #include <vector>

  <<factorial>>
  <<fibonacci_rec>>
  <<fibonacci_mem>>
  <<fibonacci_dyn>>
  <<main>>
#+END_SRC

* Benchmarks
As mentioned previously, I have done benchmarks on each of the aforementioned functions run on a dataset of 1 to 1000 (excluding the recursive implementation, which is stopped at 50 for time reasons). This is to show the performance gained from using *memoization* and *dynamic programming*.

| Function  |    Time |
|-----------+---------|
| Factorial |  0:0.18 |
| Recursive | 2:11.12 |
| Memoized  | 0:00.16 |
| Dynamic   | 0.00.18 |

As you can see, memoization and dynamic programming both produce much faster code than the non-optimized recursive implementation.
