recursion.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-12-03 Thu 13:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Recursive Functions and Dynamic Programming</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Daniel Hutzley" />
</head>
<body>
<div id="content">
<h1 class="title">Recursive Functions and Dynamic Programming</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2e7373d">1. Definitions</a></li>
<li><a href="#org9433cbb">2. Examples</a>
<ul>
<li><a href="#org8450da7">2.1. Factorial</a></li>
<li><a href="#orgc344cca">2.2. Recursive Fibonacci</a></li>
<li><a href="#org120d3c9">2.3. Memoized Fibonacci</a></li>
<li><a href="#org08b6d95">2.4. Dynamic Fibonacci</a></li>
<li><a href="#org4a665f5">2.5. Main</a></li>
<li><a href="#orgc533e04">2.6. Program Structure</a></li>
</ul>
</li>
<li><a href="#org5342c7a">3. Benchmarks</a></li>
</ul>
</div>
</div>
<p>
This document explains various uses of recursion and dynamic programming
</p>
<div id="outline-container-org2e7373d" class="outline-2">
<h2 id="org2e7373d"><span class="section-number-2">1</span> Definitions</h2>
<div class="outline-text-2" id="text-1">
<dl class="org-dl">
<dt>Recursive Function</dt><dd>A function which calls itself</dd>
<dt>Linear Recursion</dt><dd>A function which recurs only once per call</dd>
<dt>Memoization</dt><dd>A recursive function which caches some of it's values to save time</dd>
<dt>Dynamic Programming</dt><dd>A form of programming which involves simplifying tasks into smaller subtasks</dd>
</dl>
</div>
</div>

<div id="outline-container-org9433cbb" class="outline-2">
<h2 id="org9433cbb"><span class="section-number-2">2</span> Examples</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org8450da7" class="outline-3">
<h3 id="org8450da7"><span class="section-number-3">2.1</span> Factorial</h3>
<div class="outline-text-3" id="text-2-1">
<p>
This is a warm up and introduction to <b>recursion</b>. It calculates the factorial of a number using <b>linear recursion</b>.
</p>

<p>
The mathematical representation of this function is:
</p>
\begin{equation}
    f(x) =
    \begin{cases}
        1 &\mbox{if } x \leq 0 \\
        x * f(x-1) &\mbox{if } x > 0
    \end{cases}
\end{equation}

<p>
Here is the code:
</p>
<div class="org-src-container">
<pre class="src src-C++" id="orgea8c6a6"><span style="color: #c49619;">long</span> <span style="color: #c49619;">double</span>
<span style="color: #3c98e0;">factorial</span>(<span style="color: #c49619;">int</span> <span style="color: #3c98e0;">n</span>)
{
    <span style="color: #93a61a; font-weight: bold;">return</span>
        (n &lt;= 0)
         ? 1
         : n * factorial(n - 1)
    ;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc344cca" class="outline-3">
<h3 id="orgc344cca"><span class="section-number-3">2.2</span> Recursive Fibonacci</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Now, on to the main event. Here, we will be making a function to calculate the nth Fibonacci Number.
</p>

<p>
The mathematical representation of the Fibonacci Sequence is:
</p>
\begin{equation}
fib_n =
    \begin{cases}
        1 &\mbox{if } x \leq 2 \\
        fib_{n-1} + fib_{n-2} &\mbox{if } x > 2
    \end{cases}
\end{equation}

<p>
Here is the code:
</p>
<div class="org-src-container">
<pre class="src src-C++" id="org2e23414"><span style="color: #c49619;">long</span> <span style="color: #c49619;">double</span>
<span style="color: #3c98e0;">fibonacci_rec</span>(<span style="color: #c49619;">int</span> <span style="color: #3c98e0;">n</span>)
{
    <span style="color: #93a61a; font-weight: bold;">return</span>
        (n&lt;=2)
        ? 1
        : fibonacci_rec(n-1) + fibonacci_rec(n-2)
    ;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org120d3c9" class="outline-3">
<h3 id="org120d3c9"><span class="section-number-3">2.3</span> Memoized Fibonacci</h3>
<div class="outline-text-3" id="text-2-3">
<p>
While the previous function worked, it has a major problem: performance. For every increase in size of the requested number, we have to calculate every previous number in the sequence! To solve this, we can create a static cache which stores any value generated by the fibonacci function. This allows it to only calculate information it doesn't already have, a process known as <b>memoization</b>.
</p>

<p>
Since this does not translate well into math, I'll write this in psudocode.
</p>
<div class="org-src-container">
<pre class="src src-text">$cache := an array full of 0s

fib :: integer $x
function fib :=
   if $cache[$x] = 0
     $cache[$x] := fib($x - 1) + fib($x - 2)

   return $cache[$x]
end
</pre>
</div>

<p>
Here is the code:
</p>
<div class="org-src-container">
<pre class="src src-C++" id="org2c61c2c"><span style="color: #c49619;">long</span> <span style="color: #c49619;">double</span>
<span style="color: #3c98e0;">fibonacci_mem</span>(<span style="color: #c49619;">int</span> <span style="color: #3c98e0;">n</span>)
{
    <span style="color: #93a61a; font-weight: bold;">static</span> <span style="color: #3c98e0; font-weight: bold;">std</span>::<span style="color: #c49619;">vector</span>&lt;<span style="color: #c49619;">double</span>&gt; <span style="color: #3c98e0;">cache</span>(100,0);

    <span style="color: #93a61a; font-weight: bold;">if</span>(cache[n] == 0)
        cache[n] =
            (n&lt;=2)
            ? 1
            : fibonacci_mem(n-1) + fibonacci_mem(n-2)
        ;

    <span style="color: #93a61a; font-weight: bold;">return</span> cache[n];
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org08b6d95" class="outline-3">
<h3 id="org08b6d95"><span class="section-number-3">2.4</span> Dynamic Fibonacci</h3>
<div class="outline-text-3" id="text-2-4">
<p>
While the <b>memoized</b> example was good, we can still do better. We can write this function non-recursively in order to prevent the overhead of calling a function by dividing it into 2 parts. This practice is <b>dynamic programming</b>.
</p>

<p>
The psudocode for this function is
</p>
<div class="org-src-container">
<pre class="src src-text">fib :: Integer $x
function fib :=
  $prev := 1; $prev2 := 1;

  for ($i &lt;- 3..$x) do
    $buf   := $prev2
    $prev2 := $prev
    $prev  := $buf + $prev2
  end

  return $prev
end
</pre>
</div>

<p>
And the code is:
</p>
<div class="org-src-container">
<pre class="src src-C++" id="org78d0aba"><span style="color: #c49619;">long</span> <span style="color: #c49619;">double</span>
<span style="color: #3c98e0;">fibonacci_dyn</span>(<span style="color: #c49619;">int</span> <span style="color: #3c98e0;">n</span>)
{
    <span style="color: #c49619;">double</span> <span style="color: #3c98e0;">prev</span> = 1, <span style="color: #3c98e0;">prev2</span> = 1;

    <span style="color: #93a61a; font-weight: bold;">for</span>(<span style="color: #c49619;">int</span> <span style="color: #3c98e0;">i</span> = 3; i &lt;= n; i++)
    {
        <span style="color: #c49619;">double</span> <span style="color: #3c98e0;">buf</span> = prev2;
        prev2 = prev;
        prev = buf + prev2;
    }

    <span style="color: #93a61a; font-weight: bold;">return</span> prev;
}
</pre>
</div>

<p>
As you can see, we make the code calculate each number once and snake over the theoretical chain. This allows for linear execution time.
</p>
</div>
</div>

<div id="outline-container-org4a665f5" class="outline-3">
<h3 id="org4a665f5"><span class="section-number-3">2.5</span> Main</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Here, I'm including some code which will makes use of each of the above functions. This is also the code I used in the benchmarks.
</p>

<div class="org-src-container">
<pre class="src src-C++" id="org99a950a"><span style="color: #62787f;">// </span><span style="color: #62787f;">I'm using macros here to define which function to benchmark without any overh</span><span style="color: #e2468f;">ead.</span>
<span style="color: #3c98e0;">#define</span> <span style="color: #3c98e0;">fn</span>(<span style="color: #3c98e0;">n</span>) factorial(n)
<span style="color: #62787f;">//</span><span style="color: #62787f;">#define fn(n) fibonacci_rec(n)</span>
<span style="color: #62787f;">//</span><span style="color: #62787f;">#define fn(n) fibonacci_mem(n)</span>
<span style="color: #62787f;">//</span><span style="color: #62787f;">#define fn(n) fibonacci_dyn(n)</span>

<span style="color: #c49619;">int</span>
<span style="color: #3c98e0;">main</span> ()
{
    <span style="color: #93a61a; font-weight: bold;">for</span>(<span style="color: #c49619;">int</span> <span style="color: #3c98e0;">i</span> = 1; i &lt;= 1000; i++)
        <span style="color: #3c98e0; font-weight: bold;">std</span>::cout &lt;&lt; <span style="color: #3cafa5;">"Function("</span> &lt;&lt; i &lt;&lt; <span style="color: #3cafa5;">") = "</span> &lt;&lt; fn(i) &lt;&lt; <span style="color: #3c98e0; font-weight: bold;">std</span>::endl;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc533e04" class="outline-3">
<h3 id="orgc533e04"><span class="section-number-3">2.6</span> Program Structure</h3>
<div class="outline-text-3" id="text-2-6">
<p>
This section shows how all of the above code comes together
</p>
<div class="org-src-container">
<pre class="src src-C++"><span style="color: #62787f;">//</span><span style="color: #62787f;">This file is the result of tangling recursion.org. For a breakdown of how this</span><span style="color: #e2468f;"> works, refer to it.</span>
<span style="color: #3c98e0;">#include</span> <span style="color: #3cafa5;">&lt;iostream&gt;</span>
<span style="color: #3c98e0;">#include</span> <span style="color: #3cafa5;">&lt;vector&gt;</span>

<span style="color: #c49619;">long</span> <span style="color: #c49619;">double</span>
<span style="color: #3c98e0;">factorial</span>(<span style="color: #c49619;">int</span> <span style="color: #3c98e0;">n</span>)
{
    <span style="color: #93a61a; font-weight: bold;">return</span>
        (n &lt;= 0)
         ? 1
         : n * factorial(n - 1)
    ;
}
<span style="color: #c49619;">long</span> <span style="color: #c49619;">double</span>
<span style="color: #3c98e0;">fibonacci_rec</span>(<span style="color: #c49619;">int</span> <span style="color: #3c98e0;">n</span>)
{
    <span style="color: #93a61a; font-weight: bold;">return</span>
        (n&lt;=2)
        ? 1
        : fibonacci_rec(n-1) + fibonacci_rec(n-2)
    ;
}
<span style="color: #c49619;">long</span> <span style="color: #c49619;">double</span>
<span style="color: #3c98e0;">fibonacci_mem</span>(<span style="color: #c49619;">int</span> <span style="color: #3c98e0;">n</span>)
{
    <span style="color: #93a61a; font-weight: bold;">static</span> <span style="color: #3c98e0; font-weight: bold;">std</span>::<span style="color: #c49619;">vector</span>&lt;<span style="color: #c49619;">double</span>&gt; <span style="color: #3c98e0;">cache</span>(100,0);

    <span style="color: #93a61a; font-weight: bold;">if</span>(cache[n] == 0)
        cache[n] =
            (n&lt;=2)
            ? 1
            : fibonacci_mem(n-1) + fibonacci_mem(n-2)
        ;

    <span style="color: #93a61a; font-weight: bold;">return</span> cache[n];
}
<span style="color: #c49619;">long</span> <span style="color: #c49619;">double</span>
<span style="color: #3c98e0;">fibonacci_dyn</span>(<span style="color: #c49619;">int</span> <span style="color: #3c98e0;">n</span>)
{
    <span style="color: #c49619;">double</span> <span style="color: #3c98e0;">prev</span> = 1, <span style="color: #3c98e0;">prev2</span> = 1;

    <span style="color: #93a61a; font-weight: bold;">for</span>(<span style="color: #c49619;">int</span> <span style="color: #3c98e0;">i</span> = 3; i &lt;= n; i++)
    {
        <span style="color: #c49619;">double</span> <span style="color: #3c98e0;">buf</span> = prev2;
        prev2 = prev;
        prev = buf + prev2;
    }

    <span style="color: #93a61a; font-weight: bold;">return</span> prev;
}
<span style="color: #62787f;">// </span><span style="color: #62787f;">I'm using macros here to define which function to benchmark without any overh</span><span style="color: #e2468f;">ead.</span>
<span style="color: #3c98e0;">#define</span> <span style="color: #3c98e0;">fn</span>(<span style="color: #3c98e0;">n</span>) factorial(n)
<span style="color: #62787f;">//</span><span style="color: #62787f;">#define fn(n) fibonacci_rec(n)</span>
<span style="color: #62787f;">//</span><span style="color: #62787f;">#define fn(n) fibonacci_mem(n)</span>
<span style="color: #62787f;">//</span><span style="color: #62787f;">#define fn(n) fibonacci_dyn(n)</span>

<span style="color: #c49619;">int</span>
<span style="color: #3c98e0;">main</span> ()
{
    <span style="color: #93a61a; font-weight: bold;">for</span>(<span style="color: #c49619;">int</span> <span style="color: #3c98e0;">i</span> = 1; i &lt;= 1000; i++)
        <span style="color: #3c98e0; font-weight: bold;">std</span>::cout &lt;&lt; <span style="color: #3cafa5;">"Function("</span> &lt;&lt; i &lt;&lt; <span style="color: #3cafa5;">") = "</span> &lt;&lt; fn(i) &lt;&lt; <span style="color: #3c98e0; font-weight: bold;">std</span>::endl;
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org5342c7a" class="outline-2">
<h2 id="org5342c7a"><span class="section-number-2">3</span> Benchmarks</h2>
<div class="outline-text-2" id="text-3">
<p>
As mentioned previously, I have done benchmarks on each of the aforementioned functions run on a dataset of 1 to 1000 (excluding the recursive implementation, which is stopped at 50 for time reasons). This is to show the performance gained from using <b>memoization</b> and <b>dynamic programming</b>.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Function</th>
<th scope="col" class="org-right">Time</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Factorial</td>
<td class="org-right">0:0.18</td>
</tr>

<tr>
<td class="org-left">Recursive</td>
<td class="org-right">2:11.12</td>
</tr>

<tr>
<td class="org-left">Memoized</td>
<td class="org-right">0:00.16</td>
</tr>

<tr>
<td class="org-left">Dynamic</td>
<td class="org-right">0.00.18</td>
</tr>
</tbody>
</table>

<p>
As you can see, memoization and dynamic programming both produce much faster code than the non-optimized recursive implementation.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Hutzley</p>
<p class="date">Created: 2020-12-03 Thu 13:07</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
